Revit 2024 API
Document.IsDetached Property
 Identifies if a workshared document is detached. Also, see IsWorkshared
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsDetached { get; }
Visual Basic
Public ReadOnly Property IsDetached As Boolean
	Get
Visual C++
public:
property bool IsDetached {
	bool get ();
}
Remarks
 Note that Title and PathName will be empty strings if a document is detached.
See Also
Document Class
Autodesk.Revit.DB Namespace